### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sonarcube-aci.azurerm_key_vault.sonarqube_kv has been deleted
-   resource "azurerm_key_vault" "sonarqube_kv" {
-       id                              = "/subscriptions/829efd7e-aa80-4c0d-9c1c-7aa2557f8e07/resourceGroups/Terraform-Sonarqube-aci-test/providers/Microsoft.KeyVault/vaults/sonarqubekv7043" -> null
        name                            = "sonarqubekv7043"
        tags                            = {
            "Author"      = "Marcel Lupo"
            "Description" = "Sonarqube aci with caddy"
            "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
            "Terraform"   = "True"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sonarcube-aci.azurerm_key_vault_secret.password_secret has been deleted
-   resource "azurerm_key_vault_secret" "password_secret" {
        id                      = "https://sonarqubekv7043.vault.azure.net/secrets/sonarq-sa-password/c22b070a97fd48399d38ce00fabfa000"
        name                    = "sonarq-sa-password"
        tags                    = {}
-       value                   = (sensitive value) -> null
        # (5 unchanged attributes hidden)
    }

  # module.sonarcube-aci.azurerm_key_vault_secret.username_secret has been deleted
-   resource "azurerm_key_vault_secret" "username_secret" {
        id                      = "https://sonarqubekv7043.vault.azure.net/secrets/sonarq-sa-username/3c42eb3e4a2e4c49beff5a5556662c72"
        name                    = "sonarq-sa-username"
        tags                    = {}
-       value                   = (sensitive value) -> null
        # (5 unchanged attributes hidden)
    }

  # module.sonarcube-aci.azurerm_mssql_database.sonarqube_mssql_db has been deleted
-   resource "azurerm_mssql_database" "sonarqube_mssql_db" {
-       id                                  = "/subscriptions/829efd7e-aa80-4c0d-9c1c-7aa2557f8e07/resourceGroups/Terraform-Sonarqube-aci-test/providers/Microsoft.Sql/servers/sonarqubemssql7043/databases/sonarqubemssqldb9000" -> null
-       name                                = "sonarqubemssqldb9000" -> null
        tags                                = {
            "Author"      = "Marcel Lupo"
            "Description" = "Sonarqube aci with caddy"
            "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
            "Terraform"   = "True"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sonarcube-aci.azurerm_mssql_server.sonarqube_mssql has been deleted
-   resource "azurerm_mssql_server" "sonarqube_mssql" {
-       id                                   = "/subscriptions/829efd7e-aa80-4c0d-9c1c-7aa2557f8e07/resourceGroups/Terraform-Sonarqube-aci-test/providers/Microsoft.Sql/servers/sonarqubemssql7043" -> null
-       name                                 = "sonarqubemssql7043" -> null
        tags                                 = {
            "Author"      = "Marcel Lupo"
            "Description" = "Sonarqube aci with caddy"
            "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
            "Terraform"   = "True"
        }
        # (11 unchanged attributes hidden)
    }

  # module.sonarcube-aci.azurerm_resource_group.sonarqube_rg[0] has been deleted
-   resource "azurerm_resource_group" "sonarqube_rg" {
-       id       = "/subscriptions/829efd7e-aa80-4c0d-9c1c-7aa2557f8e07/resourceGroups/Terraform-Sonarqube-aci-test" -> null
-       location = "uksouth" -> null
-       name     = "Terraform-Sonarqube-aci-test" -> null
        tags     = {
            "Author"      = "Marcel Lupo"
            "Description" = "Sonarqube aci with caddy"
            "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
            "Terraform"   = "True"
        }
    }

  # module.sonarcube-aci.azurerm_storage_account.sonarqube_sa has been deleted
-   resource "azurerm_storage_account" "sonarqube_sa" {
-       id                                = "/subscriptions/829efd7e-aa80-4c0d-9c1c-7aa2557f8e07/resourceGroups/Terraform-Sonarqube-aci-test/providers/Microsoft.Storage/storageAccounts/sonarqubesa7043" -> null
-       name                              = "sonarqubesa7043" -> null
-       primary_access_key                = (sensitive value) -> null
        tags                              = {
            "Author"      = "Marcel Lupo"
            "Description" = "Sonarqube aci with caddy"
            "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
            "Terraform"   = "True"
        }
        # (36 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sonarcube-aci.azurerm_storage_share.sonarqube["conf"] has been deleted
-   resource "azurerm_storage_share" "sonarqube" {
-       id                   = "https://sonarqubesa7043.file.core.windows.net/conf" -> null
        name                 = "conf"
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.sonarcube-aci.azurerm_container_group.sonarqube_aci will be created
+   resource "azurerm_container_group" "sonarqube_aci" {
+       dns_name_label              = "sonarqube-aci-7043"
+       dns_name_label_reuse_policy = "Unsecure"
+       exposed_port                = (known after apply)
+       fqdn                        = (known after apply)
+       id                          = (known after apply)
+       ip_address                  = (known after apply)
+       ip_address_type             = "Public"
+       location                    = "uksouth"
+       name                        = "sonarqubeaci7043"
+       network_profile_id          = (known after apply)
+       os_type                     = "Linux"
+       resource_group_name         = "Terraform-Sonarqube-aci-test"
+       restart_policy              = "OnFailure"
+       tags                        = {
+           "Author"      = "Marcel Lupo"
+           "Description" = "Sonarqube aci with caddy"
+           "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
+           "Terraform"   = "True"
        }

+       container {
+           commands                     = []
+           cpu                          = 2
+           image                        = "sonarqube:lts-community"
+           memory                       = 8
+           name                         = "sonarqube-server"
+           secure_environment_variables = (sensitive value)

+           ports {
+               port     = 9000
+               protocol = "TCP"
            }

+           volume {
+               empty_dir            = false
+               mount_path           = "/opt/sonarqube/data"
+               name                 = "data"
+               read_only            = false
+               share_name           = "data"
+               storage_account_key  = (sensitive value)
+               storage_account_name = "sonarqubesa7043"
            }
+           volume {
+               empty_dir            = false
+               mount_path           = "/opt/sonarqube/extensions"
+               name                 = "extensions"
+               read_only            = false
+               share_name           = "extensions"
+               storage_account_key  = (sensitive value)
+               storage_account_name = "sonarqubesa7043"
            }
+           volume {
+               empty_dir            = false
+               mount_path           = "/opt/sonarqube/logs"
+               name                 = "logs"
+               read_only            = false
+               share_name           = "logs"
+               storage_account_key  = (sensitive value)
+               storage_account_name = "sonarqubesa7043"
            }
+           volume {
+               empty_dir            = false
+               mount_path           = "/opt/sonarqube/conf"
+               name                 = "conf"
+               read_only            = false
+               share_name           = "conf"
+               storage_account_key  = (sensitive value)
+               storage_account_name = "sonarqubesa7043"
            }
        }
+       container {
+           commands = [
+               "caddy",
+               "reverse-proxy",
+               "--from",
+               "sonar.pwd9000.com",
+               "--to",
+               "localhost:9000",
            ]
+           cpu      = 1
+           image    = "caddy:latest"
+           memory   = 1
+           name     = "caddy-reverse-proxy"

+           ports {
+               port     = 443
+               protocol = "TCP"
            }
+           ports {
+               port     = 80
+               protocol = "TCP"
            }
        }
    }

  # module.sonarcube-aci.azurerm_key_vault.sonarqube_kv will be created
+   resource "azurerm_key_vault" "sonarqube_kv" {
+       access_policy                 = (known after apply)
+       enable_rbac_authorization     = true
+       id                            = (known after apply)
+       location                      = "uksouth"
+       name                          = "sonarqubekv7043"
+       public_network_access_enabled = true
+       resource_group_name           = "Terraform-Sonarqube-aci-test"
+       sku_name                      = "standard"
+       soft_delete_retention_days    = 90
+       tags                          = {
+           "Author"      = "Marcel Lupo"
+           "Description" = "Sonarqube aci with caddy"
+           "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
+           "Terraform"   = "True"
        }
+       tenant_id                     = "b4fd7cff-510b-4da5-b133-f7aa6f692ee2"
+       vault_uri                     = (known after apply)
    }

  # module.sonarcube-aci.azurerm_key_vault_secret.password_secret will be created
+   resource "azurerm_key_vault_secret" "password_secret" {
+       id                      = (known after apply)
+       key_vault_id            = (known after apply)
+       name                    = "sonarq-sa-password"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

  # module.sonarcube-aci.azurerm_key_vault_secret.username_secret will be created
+   resource "azurerm_key_vault_secret" "username_secret" {
+       id                      = (known after apply)
+       key_vault_id            = (known after apply)
+       name                    = "sonarq-sa-username"
+       resource_id             = (known after apply)
+       resource_versionless_id = (known after apply)
+       value                   = (sensitive value)
+       version                 = (known after apply)
+       versionless_id          = (known after apply)
    }

  # module.sonarcube-aci.azurerm_mssql_database.sonarqube_mssql_db will be created
+   resource "azurerm_mssql_database" "sonarqube_mssql_db" {
+       auto_pause_delay_in_minutes         = 60
+       collation                           = "SQL_Latin1_General_CP1_CS_AS"
+       create_mode                         = "Default"
+       creation_source_database_id         = (known after apply)
+       geo_backup_enabled                  = true
+       id                                  = (known after apply)
+       ledger_enabled                      = (known after apply)
+       license_type                        = (known after apply)
+       maintenance_configuration_name      = (known after apply)
+       max_size_gb                         = 128
+       min_capacity                        = 1
+       name                                = "sonarqubemssqldb9000"
+       read_replica_count                  = (known after apply)
+       read_scale                          = false
+       restore_point_in_time               = (known after apply)
+       sample_name                         = (known after apply)
+       server_id                           = (known after apply)
+       sku_name                            = "GP_S_Gen5_2"
+       storage_account_type                = "Zone"
+       tags                                = {
+           "Author"      = "Marcel Lupo"
+           "Description" = "Sonarqube aci with caddy"
+           "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
+           "Terraform"   = "True"
        }
+       transparent_data_encryption_enabled = true
+       zone_redundant                      = false

+       short_term_retention_policy {
+           backup_interval_in_hours = 24
+           retention_days           = 7
        }
    }

  # module.sonarcube-aci.azurerm_mssql_firewall_rule.sonarqube_mssql_fw_rules[0] will be created
+   resource "azurerm_mssql_firewall_rule" "sonarqube_mssql_fw_rules" {
+       end_ip_address   = "0.0.0.0"
+       id               = (known after apply)
+       name             = "Allow All Azure IPs"
+       server_id        = (known after apply)
+       start_ip_address = "0.0.0.0"
    }

  # module.sonarcube-aci.azurerm_mssql_server.sonarqube_mssql will be created
+   resource "azurerm_mssql_server" "sonarqube_mssql" {
+       administrator_login                  = (sensitive value)
+       administrator_login_password         = (sensitive value)
+       connection_policy                    = "Default"
+       fully_qualified_domain_name          = (known after apply)
+       id                                   = (known after apply)
+       location                             = "uksouth"
+       minimum_tls_version                  = "1.2"
+       name                                 = "sonarqubemssql7043"
+       outbound_network_restriction_enabled = false
+       primary_user_assigned_identity_id    = (known after apply)
+       public_network_access_enabled        = true
+       resource_group_name                  = "Terraform-Sonarqube-aci-test"
+       restorable_dropped_database_ids      = (known after apply)
+       tags                                 = {
+           "Author"      = "Marcel Lupo"
+           "Description" = "Sonarqube aci with caddy"
+           "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
+           "Terraform"   = "True"
        }
+       version                              = "12.0"
    }

  # module.sonarcube-aci.azurerm_resource_group.sonarqube_rg[0] will be created
+   resource "azurerm_resource_group" "sonarqube_rg" {
+       id       = (known after apply)
+       location = "uksouth"
+       name     = "Terraform-Sonarqube-aci-test"
+       tags     = {
+           "Author"      = "Marcel Lupo"
+           "Description" = "Sonarqube aci with caddy"
+           "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
+           "Terraform"   = "True"
        }
    }

  # module.sonarcube-aci.azurerm_role_assignment.kv_role_assigment["Key Vault Administrator"] will be created
+   resource "azurerm_role_assignment" "kv_role_assigment" {
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = "0e4c0ac9-2f9d-4b1f-892a-d675d212d783"
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Key Vault Administrator"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.sonarcube-aci.azurerm_storage_account.sonarqube_sa will be created
+   resource "azurerm_storage_account" "sonarqube_sa" {
+       access_tier                       = "Hot"
+       account_kind                      = "StorageV2"
+       account_replication_type          = "LRS"
+       account_tier                      = "Standard"
+       allow_nested_items_to_be_public   = true
+       cross_tenant_replication_enabled  = true
+       default_to_oauth_authentication   = false
+       enable_https_traffic_only         = true
+       id                                = (known after apply)
+       infrastructure_encryption_enabled = false
+       is_hns_enabled                    = false
+       large_file_share_enabled          = (known after apply)
+       location                          = "uksouth"
+       min_tls_version                   = "TLS1_2"
+       name                              = "sonarqubesa7043"
+       nfsv3_enabled                     = false
+       primary_access_key                = (sensitive value)
+       primary_blob_connection_string    = (sensitive value)
+       primary_blob_endpoint             = (known after apply)
+       primary_blob_host                 = (known after apply)
+       primary_connection_string         = (sensitive value)
+       primary_dfs_endpoint              = (known after apply)
+       primary_dfs_host                  = (known after apply)
+       primary_file_endpoint             = (known after apply)
+       primary_file_host                 = (known after apply)
+       primary_location                  = (known after apply)
+       primary_queue_endpoint            = (known after apply)
+       primary_queue_host                = (known after apply)
+       primary_table_endpoint            = (known after apply)
+       primary_table_host                = (known after apply)
+       primary_web_endpoint              = (known after apply)
+       primary_web_host                  = (known after apply)
+       public_network_access_enabled     = true
+       queue_encryption_key_type         = "Service"
+       resource_group_name               = "Terraform-Sonarqube-aci-test"
+       secondary_access_key              = (sensitive value)
+       secondary_blob_connection_string  = (sensitive value)
+       secondary_blob_endpoint           = (known after apply)
+       secondary_blob_host               = (known after apply)
+       secondary_connection_string       = (sensitive value)
+       secondary_dfs_endpoint            = (known after apply)
+       secondary_dfs_host                = (known after apply)
+       secondary_file_endpoint           = (known after apply)
+       secondary_file_host               = (known after apply)
+       secondary_location                = (known after apply)
+       secondary_queue_endpoint          = (known after apply)
+       secondary_queue_host              = (known after apply)
+       secondary_table_endpoint          = (known after apply)
+       secondary_table_host              = (known after apply)
+       secondary_web_endpoint            = (known after apply)
+       secondary_web_host                = (known after apply)
+       sftp_enabled                      = false
+       shared_access_key_enabled         = true
+       table_encryption_key_type         = "Service"
+       tags                              = {
+           "Author"      = "Marcel Lupo"
+           "Description" = "Sonarqube aci with caddy"
+           "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
+           "Terraform"   = "True"
        }
    }

  # module.sonarcube-aci.azurerm_storage_share.sonarqube["conf"] will be created
+   resource "azurerm_storage_share" "sonarqube" {
+       access_tier          = (known after apply)
+       enabled_protocol     = "SMB"
+       id                   = (known after apply)
+       metadata             = (known after apply)
+       name                 = "conf"
+       quota                = 1
+       resource_manager_id  = (known after apply)
+       storage_account_name = "sonarqubesa7043"
+       url                  = (known after apply)
    }

  # module.sonarcube-aci.azurerm_storage_share.sonarqube["data"] will be created
+   resource "azurerm_storage_share" "sonarqube" {
+       access_tier          = (known after apply)
+       enabled_protocol     = "SMB"
+       id                   = (known after apply)
+       metadata             = (known after apply)
+       name                 = "data"
+       quota                = 10
+       resource_manager_id  = (known after apply)
+       storage_account_name = "sonarqubesa7043"
+       url                  = (known after apply)
    }

  # module.sonarcube-aci.azurerm_storage_share.sonarqube["extensions"] will be created
+   resource "azurerm_storage_share" "sonarqube" {
+       access_tier          = (known after apply)
+       enabled_protocol     = "SMB"
+       id                   = (known after apply)
+       metadata             = (known after apply)
+       name                 = "extensions"
+       quota                = 10
+       resource_manager_id  = (known after apply)
+       storage_account_name = "sonarqubesa7043"
+       url                  = (known after apply)
    }

  # module.sonarcube-aci.azurerm_storage_share.sonarqube["logs"] will be created
+   resource "azurerm_storage_share" "sonarqube" {
+       access_tier          = (known after apply)
+       enabled_protocol     = "SMB"
+       id                   = (known after apply)
+       metadata             = (known after apply)
+       name                 = "logs"
+       quota                = 10
+       resource_manager_id  = (known after apply)
+       storage_account_name = "sonarqubesa7043"
+       url                  = (known after apply)
    }

  # module.sonarcube-aci.azurerm_storage_share_file.sonar_properties will be created
+   resource "azurerm_storage_share_file" "sonar_properties" {
+       content_length   = (known after apply)
+       content_type     = "application/octet-stream"
+       id               = (known after apply)
+       name             = "sonar.properties"
+       source           = "/home/runner/work/terraform-azurerm-sonarqube-aci/terraform-azurerm-sonarqube-aci/sonar.properties"
+       storage_share_id = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```
</details>